const REGEX = {
  ALPHA: /^[a-zA-Z ]+$/,
  NUMERIC: /^[1-9]+/,
  ARABIC: /^[\u0621-\u064A0-9#,?!$%&*()+/=@^_`{}|:\-\\. ]+$/,
  PASSWORD: /^(?=.*[a-z])(?=.*[A-Z])(?=.*[0-9])(?=.*[!@#%^&*(),.?":{}|<>]).{8,}$/,
  ALPHA_NUMERIC: /^[a-zA-Z0-9#,?!$%&*()+/=@^_`{}|:\-\\.' ]+$/,
  PHONE_NUMBER: /^\+?\d{6,15}$/,
  TURKISH: /^[a-zA-Z0-9#,?!$%&*()+/=@^_`{}|:\-\\.'ığüşöçİĞÜŞÖÇ\s\d]+$/,
  ITALIAN: /^[A-Za-zÀ-ÿ0-9\s'.,;:!?()-]+$/,
  PORTUGUESE: /^[A-Za-zÀ-ÿÇç0-9\s'.,;:!?()-]+$/,
  SPANISH: /^[a-zA-ZáéíóúñüÁÉÍÓÚÑÜ0-9#,?!$%&*()+/=@^_`{}|:\-\\.'\s\d]+$/,
  FRENCH: /^[a-zA-ZàâéèêëîïôœùûüÿçÀÂÉÈÊËÎÏÔŒÙÛÜŸÇ0-9#,?!$%&*()+/=@^_`{}|:\-\\.'\s\d]+$/,
  RUSSIAN: /^[а-яА-ЯёЁ0-9#,?!$%&*()+/=@^_`{}|:\-\\.'\s\d]+$/,
  GERMAN: /^[A-Za-zäöüÄÖÜß0-9#,?!$%&*()+/=@^_`{}|:\-\\.'\s\d]+$/,
  RUSSIAN_AND_ENGLISH: /^[a-zA-Zа-яА-ЯёЁ0-9#,?!$%&*()+/=@^_`{}|:\-\\.'\s\d]+$/,
  COLOR_HEX_CODE: /^#([A-Fa-f0-9]{6}|[A-Fa-f0-9]{7}|[A-Fa-f0-9]{8})$/,
} as const;

export default REGEX;
